In [1]:
from scipy.stats import ttest_1samp
import numpy as np

In [2]:
ages = np.genfromtxt(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\ages.csv')
print(ages)

ages_mean = np.mean(ages)
print(ages_mean)

test, pval = ttest_1samp(ages , 30)
print('p-value :' , pval)

if pval < 0.05 :      #alpha value is 0.05 or 5%
    print(" we are rejecting null hypothesis ")
else : 
    print("we are accepting null hypothesis")

[32. 34. 29. 29. 22. 39. 38. 37. 38. 36. 30. 26. 22. 22.]
31.0
p-value : 0.5605155888171379
we are accepting null hypothesis

In [3]:
from scipy.stats import ttest_ind

week1 = np.genfromtxt(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\week1.csv' , delimiter = ",")
week2 = np.genfromtxt(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\week2.csv' , delimiter = ",")
print(week1)
print("week 2 data : \n")
print(week2)

week1_mean = np.mean(week1)
week2_mean = np.mean(week2)
print("week 1 mean value : " , week1_mean)
print("week 2 mean value : " , week2_mean)

week1_std = np.std(week1)
week2_std = np.std(week2)
print("week 1 std value : " , week1_std)
print("week 2 std value : " , week2_std)

ttest ,pval = ttest_ind(week1 , week2)
print("p-value : " , pval)

if pval < 0.05 :
    print("[***reject***]")
else : 
    print("[***accept***]")

[23.90506824 26.67631982 27.27433886 24.25757125 32.40423483 39.56919357
 23.07010059 29.82068109 27.59433809 28.05639569 27.06757262 30.41192979
 25.71358554 24.94294823 28.23123807 24.95337555 18.51231639 27.46234762
 28.38016611 13.91205901 29.02615866 26.90746774 22.8677726  24.8938289
 25.96947935 26.86869621 20.72676456 27.35988314 20.68408581 21.19846143
 16.25800931 23.92517681 24.47923229 29.47050863 27.28425372 26.93339272
 28.61026924 18.88377042 33.65468651 25.69470077 20.98291356 22.69700387
 28.60278855 21.36000443 30.77685156 20.83415999 23.79367158 19.7556718
 29.54421084 20.1433138 ]
week 2 data :

[18.63431907 31.28788036 34.96797943 21.81678117 28.21619974 39.39313736
 35.52223207 27.54222109 33.64395433 25.31673581 28.81392191 30.7358016
 26.37241881 26.0945555  26.34073477 19.42196017 32.58797652 24.84001926
 28.93348335 20.43667584 22.72495967 32.31728012 35.384306   29.66709637
 24.53512973 30.91406007 19.56117513 24.90816833 30.13163726 31.47466199
 27.77683598 16.51307462 35.0770162  31.74818107 36.36053496 27.70500593
 29.49869936 27.65575346 37.18504075 25.16055104 29.26553553 38.22163057
 28.92102091 24.8215439  38.30155495 34.76020645 22.26869162 28.82593733
 32.00975127 36.46437665]
week 1 mean value :  25.4480593952
week 2 mean value :  29.0215681076
week 1 std value :  4.531693386680561
week 2 std value :  5.497966708987187
p-value :  0.000676767690454633
[***reject***]

In [4]:
import pandas as pd
from scipy import stats

df = pd.read_csv(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\blood_pressure.csv')
df[['bp_before' , 'bp_after']].describe()
ttest , pval = stats.ttest_rel(df['bp_before'] , df['bp_after'])

print(pval)
if pval < 0.05 :
    print("***REJECT***")
else : 
    print("***ACCEPT***")

0.0011297914644840823
***REJECT***

In [5]:
mydata_house = pd.read_csv(r'E:\Python video\Data Analaysis (MFT)\Data analysis (MFT)\dataset csv\house.csv')
mydata_house

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33
...,...,...,...,...,...,...,...,...
3474,86,2,True,True,True,Southern Janatabad,3.500000e+09,116666.67
3475,83,2,True,True,True,Niavaran,6.800000e+09,226666.67
3476,75,2,False,False,False,Parand,3.650000e+08,12166.67
3477,105,2,True,True,True,Dorous,5.600000e+09,186666.67
3478,82,2,False,True,True,Parand,3.600000e+08,12000.00

In [6]:
mydata_house.dtypes

Area           object
Room            int64
Parking          bool
Warehouse        bool
Elevator         bool
Address        object
Price         float64
Price(USD)    float64
dtype: object

In [7]:
mydata_house['Area'] = pd.to_numeric(mydata_house.Area , errors = 'coerce') #change type
mydata_house.replace({False : 0 , True : 1} , inplace = True)  # change type 

mydata_house

C:\Users\PARS SYS\AppData\Local\Temp\ipykernel_6916\2624338282.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  mydata_house.replace({False : 0 , True : 1} , inplace = True)  # change type

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63.0,1,1,1,1,Shahran,1.850000e+09,61666.67
1,60.0,1,1,1,1,Shahran,1.850000e+09,61666.67
2,79.0,2,1,1,1,Pardis,5.500000e+08,18333.33
3,95.0,2,1,1,1,Shahrake Qods,9.025000e+08,30083.33
4,123.0,2,1,1,1,Shahrake Gharb,7.000000e+09,233333.33
...,...,...,...,...,...,...,...,...
3474,86.0,2,1,1,1,Southern Janatabad,3.500000e+09,116666.67
3475,83.0,2,1,1,1,Niavaran,6.800000e+09,226666.67
3476,75.0,2,0,0,0,Parand,3.650000e+08,12166.67
3477,105.0,2,1,1,1,Dorous,5.600000e+09,186666.67
3478,82.0,2,0,1,1,Parand,3.600000e+08,12000.00

In [8]:
mydata_house.isnull().sum()

Area           6
Room           0
Parking        0
Warehouse      0
Elevator       0
Address       23
Price          0
Price(USD)     0
dtype: int64

In [9]:
mydata_house.drop(index = mydata_house.Address[mydata_house.Address.isnull()].index,inplace= True)   #drop null : Address
mydata_house.shape

(3456, 8)

In [10]:
mydata_house.drop(index = mydata_house.Area[mydata_house.Area.isnull()].index,inplace= True)   #drop null : Area
mydata_house.shape

(3450, 8)

In [11]:
mydata_house.drop_duplicates(inplace=True)
mydata_house.shape

(3242, 8)

In [12]:
mydata_house.reset_index(drop = True , inplace = True)

In [16]:
address = set (mydata_house.Address)
Address = {}
for i , j in enumerate (address , start = 1):
    x = {j : i}
    Address.update(x)
number_address = mydata_house.Address.map(lambda s:Address.get(s) if s in Address else s)
number_address

0       175
1       175
2       135
3       189
4        55
       ...
3237     23
3238     52
3239    123
3240     65
3241      1
Name: Address, Length: 3242, dtype: int64

In [18]:
address = set(mydata_house.Address)
Address = {}
for i in address :
    j = mydata_house[mydata_house['Address'] == i].Price.sum() / mydata_house[mydata_house["Address"] == i].Area.sum()
    x = {i : j}
    Address.update(x)
avrage_price = mydata_house.Address.map(lambda s:Address.get(s) if s in Address else s)
avrage_price

0       3.668519e+07
1       3.668519e+07
2       8.204639e+06
3       1.000572e+07
4       8.625069e+07
            ...
3237    3.738220e+07
3238    3.945778e+07
3239    1.106100e+08
3240    9.718675e+07
3241    6.521264e+06
Name: Address, Length: 3242, dtype: float64

In [20]:
mydata_house.drop(mydata_house[(mydata_house['Area'] > 500.0) &
                (mydata_house['Room'] < 4)].index , axis = 0 , inplace = True)

In [21]:
mydata_house

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63.0,1,1,1,1,Shahran,1.850000e+09,61666.67
1,60.0,1,1,1,1,Shahran,1.850000e+09,61666.67
2,79.0,2,1,1,1,Pardis,5.500000e+08,18333.33
3,95.0,2,1,1,1,Shahrake Qods,9.025000e+08,30083.33
4,123.0,2,1,1,1,Shahrake Gharb,7.000000e+09,233333.33
...,...,...,...,...,...,...,...,...
3237,63.0,1,1,1,0,Feiz Garden,1.890000e+09,63000.00
3238,86.0,2,1,1,1,Southern Janatabad,3.500000e+09,116666.67
3239,83.0,2,1,1,1,Niavaran,6.800000e+09,226666.67
3240,105.0,2,1,1,1,Dorous,5.600000e+09,186666.67
3241,82.0,2,0,1,1,Parand,3.600000e+08,12000.00

In [24]:
mydata_house['avrage_mean_price'] = avrage_price
mydata_house['Address'] = number_address
mydata_house

       Area  Room  Parking  Warehouse  Elevator  Address  avrage_mean_price
0      63.0     1        1          1         1      175       3.668519e+07
1      60.0     1        1          1         1      175       3.668519e+07
2      79.0     2        1          1         1      135       8.204639e+06
3      95.0     2        1          1         1      189       1.000572e+07
4     123.0     2        1          1         1       55       8.625069e+07
...     ...   ...      ...        ...       ...      ...                ...
3237   63.0     1        1          1         0       23       3.738220e+07
3238   86.0     2        1          1         1       52       3.945778e+07
3239   83.0     2        1          1         1      123       1.106100e+08
3240  105.0     2        1          1         1       65       9.718675e+07
3241   82.0     2        0          1         1        1       6.521264e+06

[3233 rows x 7 columns]